Revit 2027 API
ViewSchedule.IsValidCategoryForMaterialTakeoff Method
 Checks whether a category can be used for a material takeoff.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool IsValidCategoryForMaterialTakeoff(
	ElementId categoryId
)
Public Shared Function IsValidCategoryForMaterialTakeoff (
	categoryId As ElementId
) As Boolean
public:
static bool IsValidCategoryForMaterialTakeoff(
	ElementId^ categoryId
)
static member IsValidCategoryForMaterialTakeoff :
        categoryId : ElementId -> bool
Parameters
categoryId ElementId
 The category ID to check.
Return Value
Boolean
 True if the category can be used for a material takeoff, false otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ViewSchedule Class
Autodesk.Revit.DB Namespace